tsung.xml
<?xml version="1.0"?>

<!-- This file is Tsung config I made to load test the websocket. -->
<!-- Need to ensure that this path is correct. This is for Ubuntu machine. Another OS may vary. -->
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

  <!-- This should configured differently when you use multiple machine -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="50000" />
  </clients>

<!-- Your target server and ports. -->
  <servers>
    <server host="104.248.158.32" port="4000" type="tcp" />
  </servers>

 <!-- Connections -->
  <load>
    <arrivalphase phase="1" duration="1" unit="minute">
      <users maxnumber="10" arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="15" unit="minute">
      <users maxnumber="10000" arrivalrate="10" unit="second"></users>
    </arrivalphase>
  </load>

<!-- Pretty much standard config for websocket, you want to maximize ports utilization -->
  <options>
    <option name="ports_range" min="1025" max="65535"/>
  </options>


  <sessions>
    <session name="websocket" probability="100" type="ts_websocket">
        <request>
             <websocket type="connect" path="/ws/websocket"></websocket>
        </request>

      <request subst="true">
        <websocket type="message">{"topic":"data:echo", "event":"phx_join", "payload": {"user":"%%ts_user_server:get_unique_id%%"}, "ref":"1"}</websocket>
      </request>


    <!-- This is how you keep the connection alive when dealing with Phoenix Channel. -->
      <for var="heartbeat" from="1" to="9999" incr="1">
        <thinktime value="25"/>
        <request>
            <websocket type="message">{"topic":"phoenix", "event":"heartbeat", "payload": {}, "ref":"2"}</websocket>
        </request>
      </for>

    </session>
  </sessions>
</tsung>